app/Controllers/Home.php

    public function index()
    {
        $model = new  \App\Models\VibeCheckModel();

        $data = $model->first();
---
SELECT *
FROM `vibecheck`
 LIMIT 1

    public function store($acceleration, $velocity, $demodulation, $custom_value)
    {
        $model = new  \App\Models\VibeCheckModel();
        $data = [
            'acceleration' => $acceleration,
            'velocity' => $velocity,
            'demodulation' => $demodulation,
            'custom_value' => $custom_value
        ];

        // Simpan data ke database
        $model->insert($data);
---
INSERT INTO `vibecheck` (`acceleration`, `velocity`, `demodulation`, `custom_value`, `created_at`, `updated_at`) VALUES ('0.123', '0.456', '0.789', '1.234', '2024-11-08 08:08:28', '2024-11-08 08:08:28')